pub const BOT_START_COMMAND: &str = "/start";

pub const BOT_USERNAME_MESSAGE: &str = "Test client";

pub const BOT_WISH_MESSAGE: &str = "Велик";

pub const CITY_CALLBACK_MSK: &str = "__msk_callback";

pub const REPEAT_START_MESSAGE: &str = "Хитрец! Больше одного подарка не положено";

pub const START_MESSAGES_RESPONSE: [&str; 4] = [
    "Хо-хо-хо! Приветствую тебя в тайном чате Бай Семьи!",
    "",
    "А почему он тайный, спросишь ты? Потому что здесь мы распределяем Тайных Сант на самый волшебный праздник – Новый Год 🎅🎄",
    "А теперь, внучок, представься и назови мне свое имя"];

pub const RECEIVE_NAME_RESPONSE: [&str; 3] = [
    "Скажи, что ты хочешь получить в подарок, но только учти, что у дедушки есть только 2000 рублей для исполнения твоего желания (такие нынче пенсии).",
    "",
    "Пиши подробно! \n\n«Не знаю чего хочу» не принимается, лучше запиши как можно больше, чтобы у дедушки был выбор и он не подарил тебе какую-нибудь ненужную кракозябру, которую ты передаришь."];

pub const RECEIVE_WISH_RESPONSE: &str =
    "Хо-хо-хо! А теперь, внучок, скажи дедушке в каком городе ты проживаешь";

pub const RECEIVE_CITY_RESPONSE: [&str; 5] = [
    "Москва, Какой хороший город! Спасибо, внучок, дедушка всё записал.",
    "",
    "Теперь дождись, когда остальные внучата запишутся и мы торжественно распределим Тайных Сант и подопечных.",
    "Но ни в коем случае не раскрывай кто ты, иначе дух праздника и волшебства пропадет навсегда!",
    ""];
